Revit 2027 API
BuiltInFailures.FamilyFailures.DuplicateParamName Property
 Family parameters have duplicate names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateParamName { get; }
Public Shared ReadOnly Property DuplicateParamName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateParamName {
	FailureDefinitionId^ get ();
}
static member DuplicateParamName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace